const testData = [
  {
    id: "1fc40cb6-130d-459a-b694-8af5a51ae96f",
    from: "行政管理",
    title: "《台大EMBA校友基金會》【點亮希望・愛－感恩慈善音樂會】歡迎報名參加",
    date: 1693723627689,
    isRead: false,
    inTrash: false,
    content:
      "校友基金會歲末重磅活動 【點亮希望・愛－臺大EMBA感恩慈善音樂會】 ✯ 時間：12/19（週二）19:30 ✯ 地點：國家音樂廳 ♥♥♥ 誠摯邀請各級學長姐攜手共襄盛舉，點亮「希望·愛」，共創歲末佳節溫馨與美好 ♥♥♥ 臺大EMBA校友基金會多年來積極參與社會公益，今年主題聚焦在啟發希望，用教育翻轉未來，為「偏鄉教育、希望工程」盡一份心力，誠摯邀集學長姐以慈愛之心，點亮灌溉台灣偏鄉教育、希望的種子，攜手一起散播希望散播愛。 「點亮希望・愛－臺大EMBA感恩慈善音樂會」由指揮吳曜宇領軍台北愛樂青年管弦樂團與台北愛樂合唱團連袂演出，以霍爾斯特《行星組曲》呼應主題中的「希望」，在浩瀚無垠的天際中，尋找無限的可能。 曠世巨作《行星組曲》以太陽系中七大行星命名而來，龐大堅強的陣容，加上兩組女聲三部合唱及管風琴，是您一生絕對要親臨感受一次的震撼！ 本場音樂會很榮幸邀請到2023年第一屆盧布爾雅納音樂節國際鋼琴大賽首獎得主-張凱閔，合作演出這首高難度浪漫樂曲。",
  },
  {
    id: "2a7fe6ab-6e45-4b17-9c2b-89b5e74593bd",
    from: "活動",
    title: "《校園嘉年華》歡迎大家踴躍參加",
    date: 1693723627690,
    isRead: false,
    inTrash: false,
    content:
      "親愛的同學們，校園嘉年華即將來臨！讓我們一起度過歡樂的時光，有各種精彩的活動等著大家。記得提前報名參加哦！",
  },
  {
    id: "3b7c8eaa-fb3b-4bd4-9a37-882cefb1eb23",
    from: "教務",
    title: "重要通知：期末考試安排",
    date: 1693723627691,
    isRead: false,
    inTrash: false,
    content:
      "各位同學，請注意！期末考試安排已經確定，請務必提前準備好，按時參加考試。祝大家都能取得好成績！",
  },
  {
    id: "4f3d5f6e-8c7a-4c72-9be0-62a5cf7a6d1a",
    from: "行政管理",
    title: "《招聘公告》校內實習機會",
    date: 1693723627692,
    isRead: false,
    inTrash: false,
    content:
      "各位同學，我們提供了校內實習機會，歡迎有興趣的同學前來報名。這是一個難得的學習機會，請把握住！",
  },
  {
    id: "5e0a03f5-8e2a-43a2-b9a0-54cf2fbdb471",
    from: "行政管理",
    title: "《校園足球賽》報名開始",
    date: 1693723627693,
    isRead: true,
    inTrash: false,
    content:
      "喜歡足球的同學們，這是一個展現你們技術的好機會！趕快報名參加校園足球賽，和同學們一起享受比賽的樂趣。",
  },
  {
    id: "6aaf5f5b-6e65-48db-8a44-ec933c6848b1",
    from: "教務",
    title: "選課通知：下學期選課即將開始",
    date: 1693723627694,
    isRead: true,
    inTrash: false,
    content:
      "各位同學，請注意！下學期的選課即將開始，請提前了解好自己的課程需求，以免錯過重要課程。",
  },
  {
    id: "7daa3db3-6b4e-4d03-b95b-2d3f6a2b5fb9",
    from: "行政管理",
    title: "重要通知：校內設施維護工程",
    date: 1693723627695,
    isRead: true,
    inTrash: true,
    content:
      "各位同學，請注意！為了維護校內設施，我們將進行相關維護工程，請大家注意相關通知，避免影響正常使用。",
  },
  {
    id: "8bcf2d32-8c0b-4e13-aebd-d35ef1bcb3f6",
    from: "活動",
    title: "《藝術展覽》校內藝術家作品展示",
    date: 1693723627696,
    isRead: true,
    inTrash: true,
    content:
      "親愛的同學們，我們有幸邀請到校內藝術家的作品展示。請踴躍參觀，一起欣賞校內藝術的風采。",
  },
  {
    id: "9c5c8649-b249-4ab3-bbf3-ebd6f3810b67",
    from: "教務",
    title: "學術演講通知：邀請知名學者講座",
    date: 1693723627697,
    isRead: true,
    inTrash: true,
    content:
      "各位同學，我們將邀請知名學者進行學術演講，屆時請踴躍參加，共同探討學術議題。",
  },
  {
    id: "10e7c10f-18a7-4c5a-bb62-8035f4c74c87",
    from: "行政管理",
    title: "重要通知：校內交通調整",
    date: 1693723627698,
    isRead: true,
    inTrash: true,
    content:
      "各位同學，請注意！為了校內交通安全，我們將進行相關調整，請大家留意校內交通變化，以免影響正常通行。",
  },
];

export { testData };
